get-gcd-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getGcdRequest>
         <gs:name>test</gs:name>
      </gs:getGcdRequest>
   </soapenv:Body>
</soapenv:Envelope>
